#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# Напишите программу, которая принимает на вход координаты двух точек 
# и находит расстояние между ними в 2D пространстве.

# x1=int(input('Ведите координаты х1: '))
# y1=int(input('Ведите координаты у1: '))
# x2=int(input('Ведите координаты х2: '))
# y2=int(input('Ведите координаты у2: '))

# print(((x2-x1)**2+(y2-y2)**2)**0.5)


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# Напишите программу для. проверки истинности утверждения 
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.    

# for x in range(2):
#     for y in range(2):
#         for z in range(2):
#             print((not(x or y or z))==(not x and not y and not z))